In [250]:
import pandas as pd
train = pd.read_csv('./data/train.csv')
test = pd.read_csv('./data/test.csv')
# print(train.info())
# print(test.info())
train.shape

(891, 12)

In [251]:
#Use the Regular Expression to get the title from the name field.
import re
pattern = re.compile(r'.*?,(.*?)\.')
def getTitle(x):
    result = pattern.search(x)
    if result:
        return result.group(1).strip()
    else:
        return ''

train['Title'] = train['Name'].map(getTitle)
test['Title'] = test['Name'].map(getTitle)

# print('*' * 20, 'number of data is not null')
# print(train['Title'][train['Age']>0].value_counts())
# print('=' * 20, 'number of data is null')

# #Check how many rows missing the Age by Title
# print(train['Title'][train['Age'].isnull()].value_counts())
# print(test['Title'][test['Age'].isnull()].value_counts())


#Set the missing Age of Title 'Master' 
master_age_mean = train['Age'][(train['Title']=='Master')&(train['Age']>0)].mean()

# Debug - how to get the index and the colum on that index.
# print('*' * 20)
# print(train.loc[train[(train['Title']=='Master')&(train['Age'].isnull())].index])
# print(train.loc[train[(train['Title']=='Master')&(train['Age'].isnull())].index, 'Age'])

train.loc[train[(train['Title']=='Master')&(train['Age'].isnull())].index, 'Age'] = master_age_mean
test.loc[test[(test['Title']=='Master')&(test['Age'].isnull())].index, 'Age'] = master_age_mean

#Set the missing Age of Title 'Mr' 
mr_age_mean = train['Age'][(train['Title']=='Mr')&(train['Age']>0)].mean()
train.loc[train[(train['Title']=='Mr')&(train['Age'].isnull())].index, 'Age'] = mr_age_mean
test.loc[test[(test['Title']=='Mr')&(test['Age'].isnull())].index, 'Age'] = mr_age_mean

#Set the missing Age of Title 'Miss' or 'Ms'
miss_age_mean = train['Age'][(train['Title']=='Miss')&(train['Age']>0)].mean()
train.loc[train[(train['Title']=='Miss')&(train['Age'].isnull())].index, 'Age'] = miss_age_mean
test.loc[test[((test['Title']=='Miss')|(test['Title']=='Ms'))&(test['Age'].isnull())].index, 'Age'] = miss_age_mean

#Set the missing Age of Title 'Mrs' 
mrs_age_mean = train['Age'][(train['Title']=='Mrs')&(train['Age']>0)].mean()
train.loc[train[(train['Title']=='Mrs')&(train['Age'].isnull())].index, 'Age'] = mrs_age_mean
test.loc[test[(test['Title']=='Mrs')&(test['Age'].isnull())].index, 'Age'] = mrs_age_mean

#Set the missing Age of Title 'Dr' 
dr_age_mean = train['Age'][(train['Title']=='Dr')&(train['Age']>0)].mean()
train.loc[train[(train['Title']=='Dr')&(train['Age'].isnull())].index, 'Age'] = dr_age_mean
test.loc[test[(test['Title']=='Mrs')&(test['Age'].isnull())].index, 'Age'] = dr_age_mean

# print(train['Age'].describe())
# print(test['Age'].describe())
print(train.shape)
train.head(3)

(891, 13)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss

In [252]:
train['Age'].isnull().sum()

0

In [253]:
pd.unique(train['Title'])
# type(train)

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Mme', 'Ms',
       'Major', 'Lady', 'Sir', 'Mlle', 'Col', 'Capt', 'the Countess',
       'Jonkheer'], dtype=object)

In [254]:
train = train.drop(['Name','PassengerId'], 1) # 1 for column and 0 for row

In [255]:
combine = [train, test]
for train in combine: 
    train['Title'] = train['Title'].replace(['Lady', 'Countess','Capt', 'Col',\
 	'Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Rare')
    train['Title'] = train['Title'].replace('Mlle', 'Miss')
    train['Title'] = train['Title'].replace('Ms', 'Miss')
    train['Title'] = train['Title'].replace('Mme', 'Mrs')
    
combine[0].head(3)
# pd.unique(train['Title'])

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss

In [256]:
train.Cabin.isnull().sum()
# pd.unique(train.Cabin)

327

In [257]:
for train in combine: 
    train['Cabin'] = train['Cabin'].fillna("XX");
    train['Cabin'].replace('A.*', "A", regex=True, inplace=True)
    train['Cabin'].replace('B.*', "B", regex=True, inplace=True)
    train['Cabin'].replace('C.*', "C", regex=True, inplace=True)
    train['Cabin'].replace('D.*', "D", regex=True, inplace=True)
    train['Cabin'].replace('E.*', "E", regex=True, inplace=True)
    train['Cabin'].replace('F.*', "F", regex=True, inplace=True)
    
combine[0].head(3)

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,0,3,male,22.0,1,0,A/5 21171,7.2500,XX,S,Mr
1,1,1,female,38.0,1,0,PC 17599,71.2833,C,C,Mrs
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,XX,S,Miss

In [258]:
for dataset in combine:
   dataset.rename(columns={"Fare":"Spending", "Survived":"Involoved", "Cabin":"Product",\
                           "Parch":"Channel", "Embarked": "Location"}, inplace=True)

combine[0].head(3)

,Involoved,Pclass,Sex,Age,SibSp,Channel,Ticket,Spending,Product,Location,Title
0,0,3,male,22.0,1,0,A/5 21171,7.2500,XX,S,Mr
1,1,1,female,38.0,1,0,PC 17599,71.2833,C,C,Mrs
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,XX,S,Miss

In [259]:
for train in combine: 
    train['SpendingCat'] = pd.cut(train['Spending'], [-0.1, 50, 100, 150, 200, 300, 1000], right=True, 
        labels=[0, 1, 2, 3, 4, 5])
    train['AgeCat'] = pd.cut(train['Age'], [-0.1, 12.1, 20, 30, 35, 40, 45, 50, 55, 65, 100], right=True, 
        labels=[0, 1, 2, 3, 4, 5, 6, 7, 8, 9])
    
combine[0].to_csv('./data/user_train.csv')
combine[1].to_csv('./data/user_test.csv')
combine[0].head(3)

,Involoved,Pclass,Sex,Age,SibSp,Channel,Ticket,Spending,Product,Location,Title,SpendingCat,AgeCat
0,0,3,male,22.0,1,0,A/5 21171,7.2500,XX,S,Mr,0,2
1,1,1,female,38.0,1,0,PC 17599,71.2833,C,C,Mrs,1,4
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,XX,S,Miss,0,2

# Done fake the data and start to process them for the model.